uhnp/src/Documents/ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет/ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет</name>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.МеждународныйБезКорреспонденции</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>InformationRegister.ОсновныеСредстваМеждународныйУчет</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПеревода</name>
    <type>
      <types>EnumRef.ВидыВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУчета</name>
    <type>
      <types>EnumRef.ПорядокУчетаСтоимостиВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУчетаФлаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаФлаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизацииФлаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодНачисленияАмортизацииФлаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияФлаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательНаработки</name>
    <type>
      <types>CatalogRef.ПоказателиНаработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательНаработкиФлаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемНаработкиФлаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентУскоренияФлаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовФлаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовФлаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ОсновныеСредстваМеждународныйУчет/ОсновныеСредстваМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеСредстваМеждународныйУчет</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </resources>
  <resources>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>DefinedType.ИнвентарныйНомерОбъектовЭксплуатации</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>ВидАктива</name>
    <type>
      <types>EnumRef.ВидыВнеоборотныхАктивов</types>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимостьПредставления</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокУчета</name>
    <type>
      <types>EnumRef.ПорядокУчетаСтоимостиВнеоборотныхАктивов</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СрокИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательНаработки</name>
    <type>
      <types>CatalogRef.ПоказателиНаработки</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <attributes>
    <name>РесурсыОбновлены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ПорядокУчетаСтоимостиВнеоборотныхАктивов/ПорядокУчетаСтоимостиВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокУчетаСтоимостиВнеоборотныхАктивов</name>
  <enumValues>
    <name>НачислятьАмортизацию</name>
  </enumValues>
  <enumValues>
    <name>НеНачислятьАмортизацию</name>
  </enumValues>
  <enumValues>
    <name>СписыватьПриПринятииКУчету</name>
  </enumValues>
  <enumValues>
    <name>АмортизацияНачислена</name>
  </enumValues>
  <enumValues>
    <name>НачислитьАмортизациюПриПринятииКУчету</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизацииИлиСписаниеНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>НеПриниматьКУчетуВключитьВРасходы</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыНачисленияАмортизацииОС/СпособыНачисленияАмортизацииОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНачисленияАмортизацииОС</name>
  <enumValues>
    <name>Линейный</name>
  </enumValues>
  <enumValues>
    <name>УменьшаемогоОстатка</name>
  </enumValues>
  <enumValues>
    <name>ПоСуммеЧиселЛетИспользования</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноОбъемуПродукции</name>
  </enumValues>
  <enumValues>
    <name>ПоЕНАОФ</name>
  </enumValues>
  <enumValues>
    <name>ПоЕНАОФНа1000кмПробега</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыВнеоборотныхАктивов/ВидыВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВнеоборотныхАктивов</name>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>ОбъектыСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ИнвестиционноеИмущество</name>
  </enumValues>
  <enumValues>
    <name>ОсновныеСредстваПредоставляемыеВАренду</name>
  </enumValues>
  <enumValues>
    <name>НМА</name>
  </enumValues>
  <enumValues>
    <name>НИОКР</name>
  </enumValues>
  <enumValues>
    <name>ТемыЭтапыИсследованийИРазработок</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПринятоКЗабалансовомуУчету</name>
  </enumValues>
  <enumValues>
    <name>ПереданоВАренду</name>
  </enumValues>
  <enumValues>
    <name>ЗаключенДоговорАренды</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	СтруктураИзменяемыхРеквизитов = СтруктураИзменяемыхРеквизитов();
	Для Каждого КлючИЗначение Из СтруктураИзменяемыхРеквизитов Цикл
		Если Не ЭтотОбъект[КлючИЗначение.Ключ+"Флаг"] Тогда
			НепроверяемыеРеквизиты.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	НачислятьАмортизацию = (ПорядокУчета=Перечисления.ПорядокУчетаСтоимостиВнеоборотныхАктивов.НачислятьАмортизацию);
	АмортизацияПоНаработке = (МетодНачисленияАмортизации=Перечисления.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции);
	
	Если НачислятьАмортизацию И Не АмортизацияПоНаработке Тогда
		НепроверяемыеРеквизиты.Добавить("ПоказательНаработки");
		НепроверяемыеРеквизиты.Добавить("ОбъемНаработки");
	КонецЕсли;
	
	Если Не НачислятьАмортизацию Тогда
		НепроверяемыеРеквизиты.Добавить("МетодНачисленияАмортизации");
		НепроверяемыеРеквизиты.Добавить("СчетАмортизации");
		НепроверяемыеРеквизиты.Добавить("СтатьяРасходов");
		НепроверяемыеРеквизиты.Добавить("АналитикаРасходов");
		НепроверяемыеРеквизиты.Добавить("ПоказательНаработки");
		НепроверяемыеРеквизиты.Добавить("ОбъемНаработки");
	КонецЕсли;
	
	Если Не НачислятьАмортизацию Или АмортизацияПоНаработке Тогда
		НепроверяемыеРеквизиты.Добавить("СрокИспользования");
	КонецЕсли;
	
	Если Не НачислятьАмортизацию Или МетодНачисленияАмортизации<>Перечисления.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка Тогда
		НепроверяемыеРеквизиты.Добавить("КоэффициентУскорения");
	КонецЕсли;
	
	КлючевыеРеквизиты = Новый Массив;
	КлючевыеРеквизиты.Добавить("ОсновноеСредство");
	ОбщегоНазначенияУТ.ПроверитьНаличиеДублейСтрокТЧ(
		ЭтотОбъект, "ОсновныеСредства", КлючевыеРеквизиты, Отказ, НСтр("ru = 'Основные средства';
																		|en = 'Fixed assets'"));
		
	ПараметрыВыбораСтатейИАналитик = Документы.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипОснования = ТипЗнч(ДанныеЗаполнения);
	Если ТипОснования = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		ОсновныеСредства.Добавить().ОсновноеСредство = ДанныеЗаполнения;
	КонецЕсли;
	
	ИнициализироватьДокумент();
	
	ПараметрыВыбораСтатейИАналитик = Документы.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТекущиеЗначения.ПорядокУчета КАК ПорядокУчета,
		|	ТекущиеЗначения.СчетУчета КАК СчетУчета,
		|	ТекущиеЗначения.СчетАмортизации КАК СчетАмортизации,
		|	ТекущиеЗначения.МетодНачисленияАмортизации КАК МетодНачисленияАмортизации,
		|	ТекущиеЗначения.СрокИспользования КАК СрокИспользования,
		|	ТекущиеЗначения.ПоказательНаработки КАК ПоказательНаработки,
		|	ТекущиеЗначения.ОбъемНаработки КАК ОбъемНаработки,
		|	ТекущиеЗначения.КоэффициентУскорения КАК КоэффициентУскорения,
		|	ТекущиеЗначения.СтатьяРасходов КАК СтатьяРасходов,
		|	ТекущиеЗначения.АналитикаРасходов КАК АналитикаРасходов
		|ИЗ
		|	РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(
		|			&Дата,
		|			ОсновноеСредство В (&ОсновныеСредства)
		|				И Регистратор <> &ТекущийРегистратор) КАК ТекущиеЗначения"
	);
	Запрос.УстановитьПараметр("Дата", Новый Граница(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ОсновныеСредства", ОсновныеСредства.ВыгрузитьКолонку("ОсновноеСредство"));
	Запрос.УстановитьПараметр("ТекущийРегистратор", Ссылка);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СтруктураИзменяемыхРеквизитов = СтруктураИзменяемыхРеквизитов();
		Для Каждого КлючИЗначение Из СтруктураИзменяемыхРеквизитов Цикл
			Если Не ЭтотОбъект[КлючИЗначение.Ключ+"Флаг"] Тогда
				ЭтотОбъект[КлючИЗначение.Ключ] = Выборка[КлючИЗначение.Ключ];
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ПараметрыВыбораСтатейИАналитик = Документы.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОчиститьДвиженияДокумента(ЭтотОбъект, "Международный, ОсновныеСредстваМеждународныйУчет");
	
	Документы.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(
		НСтр("ru = 'Перевод основных средств и инвестиционного имущества (международный учет)';
			|en = 'Transfer of fixed assets and investment property (international accounting)'"));
	
	ПроверитьВозможностьПроведения(Отказ);
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураИзменяемыхРеквизитов()
	
	Возврат Новый Структура(
		"ПорядокУчета, СчетУчета, СчетАмортизации, МетодНачисленияАмортизации,
		|СрокИспользования, ПоказательНаработки, ОбъемНаработки, КоэффициентУскорения,
		|СтатьяРасходов, АналитикаРасходов"
	);
	
КонецФункции

Процедура ИнициализироватьДокумент()
	
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
КонецПроцедуры

Процедура ПроверитьВозможностьПроведения(Отказ=Ложь)
	
	ТребуемыйВидАктива = Перечисления.ВидыВнеоборотныхАктивов.ОсновноеСредство;
	Если НаправлениеПеревода = Перечисления.ВидыВнеоборотныхАктивов.ОсновноеСредство Тогда
		ТребуемыйВидАктива = Перечисления.ВидыВнеоборотныхАктивов.ИнвестиционноеИмущество;
	КонецЕсли;
	
	ТребуемоеСостояние = Новый Структура(
		"Организация, Состояние, ВидАктива",
		Организация,
		Перечисления.СостоянияОС.ПринятоКУчету,
		ТребуемыйВидАктива);
	ПараметрыПроверки = Новый Структура("ДатаСведений, ИсключаемыйРегистратор", Дата, Ссылка);
	Ошибки = МеждународныйУчетВнеоборотныеАктивы.ПроверитьСостояниеВнеоборотныхАктивов(
		ОсновныеСредства.ВыгрузитьКолонку("ОсновноеСредство"), ТребуемоеСостояние, ПараметрыПроверки);
	Если Ошибки=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ОсновныеСредства Цикл
		
		Данные = Ошибки.Получить(Строка.ОсновноеСредство);
		Если Данные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстОшибки = НСтр("ru = 'Учетные данные основного средства ""%1"" не могут быть изменены.';
							|en = 'Accounting data of the ""%1"" fixed asset cannot be changed.'") + Символы.ПС;
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1", Строка.ОсновноеСредство);
		Если Данные.Состояние <> Перечисления.СостоянияОС.ПринятоКУчету Тогда
			ТекстОшибки = ТекстОшибки
				+ НСтр("ru = 'Объект не принят к учету';
						|en = 'The object is not recognized'");
		Иначе
			Шаблон = НСтр("ru = 'Объект принадлежит виду ""%1"" и принят к учету в организации ""%2""';
							|en = 'The object is of type ""%1"" and it is recognized in company ""%2""'");
			ТекстОшибки = ТекстОшибки
				+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Данные.ВидАктива, Данные.Организация);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОсновныеСредства", Строка.НомерСтроки, "ОсновноеСредство"),
			,
			Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
